code_sweepdelay/newlog/stress-output_10ms_90.log
******************** Stress Settings ********************
Command:
  Type: write
  Count: -1
  Duration: 90 SECONDS
  No Warmup: false
  Consistency Level: ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Sequence: 1..1000000
  Order: ARBITRARY
  Wrap: true
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 1
  Column Names: [C0]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=1
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V4
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [cassandra_a, cassandra_b, cassandra_c]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Pptions: {replication_factor=3}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  factory=org.apache.cassandra.thrift.TFramedTransportFactory; truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=SunX509; store-type=JKS; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  Thrift Port: 9160
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: WRITE
TokenRange:
  Wrap: false
  Split Factor: 1

Connected to cluster: TestCluster, max pending requests per connection 128, max connections per host 8
Datatacenter: datacenter1; Host: cassandra_a/172.28.0.2; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_b/172.28.0.3; Rack: rack1
Datatacenter: datacenter1; Host: cassandra_c/172.28.0.4; Rack: rack1
Created keyspaces. Sleeping 3s for propagation.
Sleeping 2s...
Warming up WRITE with 150000 iterations...
Failed to connect over JMX; not collecting these stats
Running WRITE with 50 threads 90 seconds
Failed to connect over JMX; not collecting these stats
type       total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
total,          8645,    8645,    8645,    8645,     0.9,     0.6,     2.7,     7.2,    14.2,    40.5,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,         94189,   85544,   85544,   85544,     0.6,     0.5,     1.1,     1.9,     7.6,    28.1,    2.0,  0.57578,      0,      0,       0,       0,       0,       0
total,        153546,   59357,   59357,   59357,     0.8,     0.5,     1.1,     1.8,   112.6,   129.1,    3.0,  0.35187,      0,      0,       0,       0,       0,       0
total,        240499,   86953,   86953,   86953,     0.6,     0.5,     1.1,     1.8,    19.8,    24.3,    4.0,  0.25631,      0,      0,       0,       0,       0,       0
total,        282817,   42318,   42318,   42318,     1.2,     0.5,    10.3,    10.3,    18.4,    21.0,    5.0,  0.22745,      0,      0,       0,       0,       0,       0
total,        290004,    7187,    7187,    7187,     7.0,    10.3,    10.4,    10.4,    10.6,    13.4,    6.0,  0.27157,      0,      0,       0,       0,       0,       0
total,        297183,    7179,    7179,    7179,     7.0,    10.3,    10.4,    10.4,    10.6,    19.1,    7.0,  0.29490,      0,      0,       0,       0,       0,       0
total,        304341,    7158,    7158,    7158,     7.0,    10.3,    10.4,    10.4,    10.5,    15.4,    8.0,  0.30822,      0,      0,       0,       0,       0,       0
total,        310847,    6506,    6506,    6506,     6.9,    10.3,    10.4,    10.4,    13.7,    17.3,    9.0,  0.31695,      0,      0,       0,       0,       0,       0
total,        317580,    6733,    6733,    6733,     8.2,    10.3,    10.4,    11.1,   191.8,   195.6,   10.0,  0.31896,      0,      0,       0,       0,       0,       0
total,        323654,    6074,    6074,    6074,     7.2,    10.3,    10.4,    11.6,    22.9,   163.4,   11.0,  0.32062,      0,      0,       0,       0,       0,       0
total,        330777,    7123,    7123,    7123,     7.9,    10.3,    10.4,    10.9,   155.2,   164.8,   12.0,  0.31882,      0,      0,       0,       0,       0,       0
total,        337004,    6227,    6227,    6227,     8.0,    10.3,    10.4,    13.6,   161.6,   167.0,   13.0,  0.31755,      0,      0,       0,       0,       0,       0
total,        344218,    7214,    7214,    7214,     6.9,    10.2,    10.3,    10.4,    10.6,    17.6,   14.0,  0.31569,      0,      0,       0,       0,       0,       0
total,        351399,    7181,    7181,    7181,     7.0,    10.2,    10.3,    10.4,    10.4,    10.6,   15.0,  0.31336,      0,      0,       0,       0,       0,       0
total,        358576,    7177,    7177,    7177,     7.0,    10.2,    10.3,    10.4,    10.6,    10.8,   16.0,  0.31062,      0,      0,       0,       0,       0,       0
total,        365803,    7227,    7227,    7227,     6.9,    10.2,    10.3,    10.4,    10.5,    13.4,   17.0,  0.30750,      0,      0,       0,       0,       0,       0
total,        373058,    7255,    7255,    7255,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   18.0,  0.30416,      0,      0,       0,       0,       0,       0
total,        380298,    7240,    7240,    7240,     6.9,    10.2,    10.3,    10.4,    10.5,    11.3,   19.0,  0.30070,      0,      0,       0,       0,       0,       0
total,        387586,    7288,    7288,    7288,     6.9,    10.2,    10.3,    10.4,    10.5,    10.5,   20.0,  0.29710,      0,      0,       0,       0,       0,       0
total,        394819,    7233,    7233,    7233,     6.9,    10.2,    10.3,    10.4,    10.6,    10.8,   21.0,  0.29350,      0,      0,       0,       0,       0,       0
total,        402022,    7203,    7203,    7203,     6.9,    10.2,    10.3,    10.4,    10.8,    11.5,   22.0,  0.28990,      0,      0,       0,       0,       0,       0
total,        409225,    7203,    7203,    7203,     6.9,    10.2,    10.3,    10.4,    10.5,    10.9,   23.0,  0.28629,      0,      0,       0,       0,       0,       0
total,        416471,    7246,    7246,    7246,     6.9,    10.2,    10.3,    10.4,    10.7,    11.1,   24.0,  0.28265,      0,      0,       0,       0,       0,       0
total,        423642,    7171,    7171,    7171,     7.0,    10.2,    10.3,    10.4,    10.5,    10.6,   25.0,  0.27910,      0,      0,       0,       0,       0,       0
total,        430727,    7085,    7085,    7085,     7.1,    10.2,    10.3,    10.4,    10.5,    10.6,   26.0,  0.27565,      0,      0,       0,       0,       0,       0
total,        437984,    7257,    7257,    7257,     6.9,    10.2,    10.3,    10.4,    10.5,    17.6,   27.0,  0.27206,      0,      0,       0,       0,       0,       0
total,        445233,    7249,    7249,    7249,     6.9,    10.2,    10.3,    10.4,    10.5,    10.7,   28.0,  0.26857,      0,      0,       0,       0,       0,       0
total,        452488,    7255,    7255,    7255,     6.9,    10.2,    10.3,    10.4,    10.5,    13.4,   29.0,  0.26512,      0,      0,       0,       0,       0,       0
total,        459704,    7216,    7216,    7216,     6.9,    10.2,    10.3,    10.4,    10.5,    11.6,   30.0,  0.26175,      0,      0,       0,       0,       0,       0
total,        466840,    7136,    7136,    7136,     7.0,    10.3,    10.4,    10.6,    21.2,    22.4,   31.0,  0.25845,      0,      0,       0,       0,       0,       0
total,        473952,    7112,    7112,    7112,     7.0,    10.2,    10.3,    10.4,    10.5,    10.5,   32.0,  0.25528,      0,      0,       0,       0,       0,       0
total,        481123,    7171,    7171,    7171,     7.0,    10.2,    10.3,    10.4,    10.5,    15.4,   33.0,  0.25210,      0,      0,       0,       0,       0,       0
total,        488381,    7258,    7258,    7258,     6.9,    10.2,    10.3,    10.4,    10.5,    12.2,   34.0,  0.24894,      0,      0,       0,       0,       0,       0
total,        495532,    7151,    7151,    7151,     7.0,    10.2,    10.3,    10.4,    10.5,    12.5,   35.0,  0.24591,      0,      0,       0,       0,       0,       0
total,        502826,    7294,    7294,    7294,     6.8,    10.2,    10.3,    10.4,    10.5,    10.8,   36.0,  0.24286,      0,      0,       0,       0,       0,       0
total,        509214,    6388,    6388,    6388,     7.8,    10.2,    10.4,    11.9,   143.7,   146.1,   37.0,  0.23981,      0,      0,       0,       0,       0,       0
total,        516513,    7299,    7299,    7299,     6.8,    10.2,    10.3,    10.4,    10.4,    10.5,   38.0,  0.23689,      0,      0,       0,       0,       0,       0
total,        522746,    6233,    6233,    6233,     8.0,    10.2,    10.4,    11.2,   160.8,   165.0,   39.0,  0.23398,      0,      0,       0,       0,       0,       0
total,        529096,    6350,    6350,    6350,     7.9,    10.2,    10.4,    11.0,   141.3,   145.1,   40.0,  0.23115,      0,      0,       0,       0,       0,       0
total,        536242,    7146,    7146,    7146,     7.0,    10.2,    10.4,    10.5,    10.7,    12.9,   41.0,  0.22847,      0,      0,       0,       0,       0,       0
total,        543417,    7175,    7175,    7175,     7.0,    10.2,    10.3,    10.4,    10.5,    10.8,   42.0,  0.22584,      0,      0,       0,       0,       0,       0
total,        550685,    7268,    7268,    7268,     6.9,    10.2,    10.3,    10.4,    10.6,    11.2,   43.0,  0.22322,      0,      0,       0,       0,       0,       0
total,        557851,    7166,    7166,    7166,     7.0,    10.2,    10.3,    10.4,    10.6,    15.1,   44.0,  0.22069,      0,      0,       0,       0,       0,       0
total,        565161,    7310,    7310,    7310,     6.8,    10.2,    10.3,    10.4,    10.6,    13.9,   45.0,  0.21814,      0,      0,       0,       0,       0,       0
total,        572354,    7193,    7193,    7193,     6.9,    10.2,    10.3,    10.4,    10.5,    17.9,   46.0,  0.21569,      0,      0,       0,       0,       0,       0
total,        579543,    7189,    7189,    7189,     7.0,    10.2,    10.3,    10.4,    10.5,    10.9,   47.0,  0.21331,      0,      0,       0,       0,       0,       0
total,        586737,    7194,    7194,    7194,     6.9,    10.2,    10.3,    10.4,    10.5,    11.3,   48.0,  0.21098,      0,      0,       0,       0,       0,       0
total,        593872,    7135,    7135,    7135,     7.0,    10.2,    10.3,    10.4,    10.5,    17.5,   49.0,  0.20870,      0,      0,       0,       0,       0,       0
total,        601003,    7131,    7131,    7131,     7.0,    10.2,    10.3,    10.4,    16.4,    18.2,   50.0,  0.20646,      0,      0,       0,       0,       0,       0
total,        608210,    7207,    7207,    7207,     6.9,    10.3,    10.4,    10.4,    10.7,    11.0,   51.0,  0.20426,      0,      0,       0,       0,       0,       0
total,        615457,    7247,    7247,    7247,     6.9,    10.2,    10.3,    10.4,    10.6,    10.8,   52.0,  0.20209,      0,      0,       0,       0,       0,       0
total,        622584,    7127,    7127,    7127,     7.0,    10.2,    10.3,    10.4,    10.5,    10.6,   53.0,  0.20000,      0,      0,       0,       0,       0,       0
total,        629798,    7214,    7214,    7214,     6.9,    10.2,    10.3,    10.4,    10.5,    10.5,   54.0,  0.19793,      0,      0,       0,       0,       0,       0
total,        636960,    7162,    7162,    7162,     7.0,    10.2,    10.3,    10.4,    10.4,    10.5,   55.0,  0.19591,      0,      0,       0,       0,       0,       0
total,        644225,    7265,    7265,    7265,     6.9,    10.2,    10.3,    10.4,    10.5,    10.5,   56.0,  0.19389,      0,      0,       0,       0,       0,       0
total,        651428,    7203,    7203,    7203,     6.9,    10.2,    10.3,    10.4,    10.4,    10.6,   57.0,  0.19194,      0,      0,       0,       0,       0,       0
total,        658584,    7156,    7156,    7156,     7.0,    10.2,    10.3,    10.4,    10.5,    11.1,   58.0,  0.19004,      0,      0,       0,       0,       0,       0
total,        665776,    7192,    7192,    7192,     7.0,    10.2,    10.3,    10.4,    10.5,    10.6,   59.0,  0.18816,      0,      0,       0,       0,       0,       0
total,        672923,    7147,    7147,    7147,     7.0,    10.2,    10.3,    10.4,    10.5,    10.7,   60.0,  0.18633,      0,      0,       0,       0,       0,       0
total,        680149,    7226,    7226,    7226,     6.9,    10.2,    10.3,    10.4,    10.5,    10.8,   61.0,  0.18451,      0,      0,       0,       0,       0,       0
total,        687408,    7259,    7259,    7259,     6.9,    10.2,    10.3,    10.4,    10.4,    10.8,   62.0,  0.18271,      0,      0,       0,       0,       0,       0
total,        693869,    6461,    6461,    6461,     7.7,    10.2,    10.4,    11.3,   125.7,   128.5,   63.0,  0.18093,      0,      0,       0,       0,       0,       0
total,        701087,    7218,    7218,    7218,     6.9,    10.2,    10.4,    10.4,    10.6,    11.1,   64.0,  0.17921,      0,      0,       0,       0,       0,       0
total,        708398,    7311,    7311,    7311,     6.8,    10.2,    10.3,    10.4,    10.4,    10.5,   65.0,  0.17750,      0,      0,       0,       0,       0,       0
total,        714753,    6355,    6355,    6355,     7.8,    10.2,    10.3,    10.5,   151.0,   153.6,   66.0,  0.17578,      0,      0,       0,       0,       0,       0
total,        721021,    6268,    6268,    6268,     8.0,    10.2,    10.4,    11.7,   160.4,   161.1,   67.0,  0.17411,      0,      0,       0,       0,       0,       0
total,        728264,    7243,    7243,    7243,     6.9,    10.2,    10.3,    10.4,    10.7,    12.8,   68.0,  0.17251,      0,      0,       0,       0,       0,       0
total,        735468,    7204,    7204,    7204,     6.9,    10.2,    10.3,    10.4,    10.4,    10.6,   69.0,  0.17094,      0,      0,       0,       0,       0,       0
total,        742584,    7116,    7116,    7116,     7.0,    10.2,    10.4,    10.5,    13.5,    15.4,   70.0,  0.16942,      0,      0,       0,       0,       0,       0
total,        749802,    7218,    7218,    7218,     6.9,    10.2,    10.3,    10.4,    10.5,    10.7,   71.0,  0.16791,      0,      0,       0,       0,       0,       0
total,        757013,    7211,    7211,    7211,     6.9,    10.2,    10.3,    10.4,    10.4,    10.6,   72.0,  0.16642,      0,      0,       0,       0,       0,       0
total,        764249,    7236,    7236,    7236,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   73.0,  0.16496,      0,      0,       0,       0,       0,       0
total,        771413,    7164,    7164,    7164,     7.0,    10.2,    10.3,    10.4,    10.4,    10.5,   74.0,  0.16354,      0,      0,       0,       0,       0,       0
total,        778728,    7315,    7315,    7315,     6.8,    10.2,    10.3,    10.4,    10.4,    10.5,   75.0,  0.16210,      0,      0,       0,       0,       0,       0
total,        785921,    7193,    7193,    7193,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   76.0,  0.16072,      0,      0,       0,       0,       0,       0
total,        793182,    7261,    7261,    7261,     6.9,    10.2,    10.3,    10.4,    10.5,    10.6,   77.0,  0.15934,      0,      0,       0,       0,       0,       0
total,        800436,    7254,    7254,    7254,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   78.0,  0.15799,      0,      0,       0,       0,       0,       0
total,        807643,    7207,    7207,    7207,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   79.0,  0.15667,      0,      0,       0,       0,       0,       0
total,        814930,    7287,    7287,    7287,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   80.0,  0.15536,      0,      0,       0,       0,       0,       0
total,        822078,    7148,    7148,    7148,     7.0,    10.2,    10.3,    10.4,    10.5,    10.9,   81.0,  0.15410,      0,      0,       0,       0,       0,       0
total,        829334,    7256,    7256,    7256,     6.9,    10.2,    10.3,    10.4,    10.5,    10.7,   82.0,  0.15283,      0,      0,       0,       0,       0,       0
total,        836587,    7253,    7253,    7253,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   83.0,  0.15159,      0,      0,       0,       0,       0,       0
total,        843888,    7301,    7301,    7301,     6.8,    10.2,    10.3,    10.4,    10.5,    10.7,   84.0,  0.15035,      0,      0,       0,       0,       0,       0
total,        851133,    7245,    7245,    7245,     6.9,    10.2,    10.3,    10.4,    10.4,    10.5,   85.0,  0.14915,      0,      0,       0,       0,       0,       0
total,        858352,    7219,    7219,    7219,     6.9,    10.2,    10.3,    10.4,    10.4,    10.6,   86.0,  0.14797,      0,      0,       0,       0,       0,       0
total,        865542,    7190,    7190,    7190,     7.0,    10.2,    10.3,    10.4,    10.5,    10.9,   87.0,  0.14681,      0,      0,       0,       0,       0,       0
total,        872653,    7111,    7111,    7111,     7.0,    10.2,    10.4,    10.6,    16.2,    17.5,   88.0,  0.14568,      0,      0,       0,       0,       0,       0
total,        879953,    7300,    7300,    7300,     6.8,    10.2,    10.3,    10.4,    10.5,    10.8,   89.0,  0.14454,      0,      0,       0,       0,       0,       0
total,        887189,    7236,    7236,    7236,     6.9,    10.2,    10.3,    10.4,    10.4,    10.7,   90.0,  0.14342,      0,      0,       0,       0,       0,       0
total,        892303,    6077,    6077,    6077,     8.3,    10.2,    10.4,    15.7,   144.6,   146.5,   90.8,  0.14232,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :    9,823 op/s  [WRITE: 9,823 op/s]
Partition rate            :    9,823 pk/s  [WRITE: 9,823 pk/s]
Row rate                  :    9,823 row/s [WRITE: 9,823 row/s]
Latency mean              :    5.0 ms [WRITE: 5.0 ms]
Latency median            :    0.8 ms [WRITE: 0.8 ms]
Latency 95th percentile   :   10.3 ms [WRITE: 10.3 ms]
Latency 99th percentile   :   10.4 ms [WRITE: 10.4 ms]
Latency 99.9th percentile :   17.8 ms [WRITE: 17.8 ms]
Latency max               :  195.6 ms [WRITE: 195.6 ms]
Total partitions          :    892,303 [WRITE: 892,303]
Total errors              :          0 [WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:01:30

END